Martyna Wolny 408196

**Zadanie 4**<br>
W ćwiczeniu 4 naszym zadaniem było utworzenie dataframe oraz uzupełnienie go przykładowymi danymi i wyświetlenie danych wegług instrukcji.

In [1]:
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
data = {
    'name' : ['Miriam', 'Alia', 'Elliot', 'Jerome', 'Ember'],
    'surname' : ['Merril', 'Wardle', 'Small', 'Atkins', 'Whitley'],
    'age' : [25, 18, 47, 78, 36],
    'sex' : ['K', 'K', 'M', 'M', 'K']
}

data_frame = pd.DataFrame(data)

In [5]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [7]:
data_frame.describe(include='all')

          name surname        age  sex
count        5       5   5.000000    5
unique       5       5        NaN    2
top     Miriam  Merril        NaN    K
freq         1       1        NaN    3
mean       NaN     NaN  40.800000  NaN
std        NaN     NaN  23.530831  NaN
min        NaN     NaN  18.000000  NaN
25%        NaN     NaN  25.000000  NaN
50%        NaN     NaN  36.000000  NaN
75%        NaN     NaN  47.000000  NaN
max        NaN     NaN  78.000000  NaN

In [8]:
data_frame.head(n=3)

     name surname  age sex
0  Miriam  Merril   25   K
1    Alia  Wardle   18   K
2  Elliot   Small   47   M

Martyna Wolny 408196